IdeaRS.OpenModel.Concrete.CalculationSetup
Concrete calculation setup

IdeaRS.OpenModel.Concrete.CalculationSetup.#ctor
Constructor

IdeaRS.OpenModel.Concrete.CalculationSetup.UlsResponse
ULS response

IdeaRS.OpenModel.Concrete.CalculationSetup.UlsDiagram
ULS capacity N-M-M

IdeaRS.OpenModel.Concrete.CalculationSetup.UlsShear
ULS shear

IdeaRS.OpenModel.Concrete.CalculationSetup.UlsTorsion
ULS torsion

IdeaRS.OpenModel.Concrete.CalculationSetup.UlsInteraction
Uls interaction

IdeaRS.OpenModel.Concrete.CalculationSetup.SlsCrack
SLS crack

IdeaRS.OpenModel.Concrete.CalculationSetup.SlsStressLimitation
SLS stress limitation

IdeaRS.OpenModel.Concrete.CalculationSetup.Detailing
Detailing

IdeaRS.OpenModel.Concrete.CalculationSetup.MNKappaDiagram
M-N-κ diagram

IdeaRS.OpenModel.Concrete.CalculationSetup.Fatigue
ULS fatigue

IdeaRS.OpenModel.Concrete.CalculationSetup.CrossSectionCharacteristics
Cross section charactertistics

IdeaRS.OpenModel.Concrete.CalculationSetup.SlsStiffnesses
SLS stiffnesses

IdeaRS.OpenModel.Concrete.CalculationSetup.SlsDeflections
SLS deflections